import math
a = int(input("Введите число a:"))
b = int(input("Введите число b:"))
c = int(input("Введите число с:"))

D = b * b - 4 * a * c
print("Дискриминант квадратного уравнения:", D)

if D < 0:
    print("Корней квадратного уравнения нет, т.к. дискриминант < 0")

elif D == 0 :
    x1 = (- b)/(2 * a)
    print("т.к. дискриминант = 0, мы получаем один квадратный корень  ", x1)

else:
    x1 = (- b + math.sqrt(D)) / 2 * a
    x2 = (- b - math.sqrt(D)) / 2 * a
    print("Первый корень уравнения:", x1)
    print("Второй корент уравнения:", x2)
